Revit 2027 API
FabricSheetLayoutPattern Enumeration
 The pattern for how the wires in Fabric Sheet are laid out.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FabricSheetLayoutPattern
Public Enumeration FabricSheetLayoutPattern
public enum class FabricSheetLayoutPattern
type FabricSheetLayoutPattern
Members
Member name | Value | Description
ActualSpacing | 0 |  The spacing between the rebars is fixed and specified by input.
FixedNumber | 1 |  The spacing between the rebars is adjustable, but the number of bars is constant based on input.
MaximumSpacing | 2 |  The maximum distance between the rebars is specified by input, and the number of rebars changes based on the length of rebar set.
NumberWithSpacing | 3 |  Both the spacing between the rebars and the number of rebars are constant based on input.
QuantitativeSpacing | 4 |  Multiple groups of wires with a specific spacing and diameter
See Also
Reference
Autodesk.Revit.DB.Structure Namespace